[
    {
        "id": "until",
        "name": "Until",
        "logo": "logo-until-blue.svg",
        "images": [
            "until-timeline.png",
            "until-credit-dashboard.png"
        ],
        "summary": "Until manages several clubs for health trainers and clinicians. Members at Until can book sessions with their clients on demand. They remove the overhead of leasing and maintenance, allowing the professionsials to focus on treating their patients. {/n} The product manager and I built the core of their booking application from scratch in about four months. I was really proud of the booking experience we designed and built, particularly the timeline component I created. It's a powerful tool that manages dozens of states, inputs, and user interactions. {/n} From this core application, I added hundreds of new features to keep up with the company's rapidly evolving business model: subscriptions, ordering and payments, dashboards, and a door lock management solution. I gained proficiency in AWS infrastructure and server development technoligies. And I researched and planned our transition from a responsive web app to a universal application."
    },
    {
        "id": "ncr",
        "name": "NCR",
        "logo": "logo-rcn.png",
        "images": [
            "ncr-emeral-pos.webp",
            "ncr-emerald-grocer.webp"
        ],
        "summary": "At NCR, I managed a team of 7 Software Engineers. I lead team standups, retros, and refinement sessions. I participated in interviews. And I mentored team members and evaluated their performance. {/n}I was also the technical lead on our team. I created the technical specifications for development tasks. I was responsible for PI planning, a large research initiative to map out all new features for an entire quarter. I identified and mitigated all extra team dependencies and blockers. I was the point man for technical questions. And I played a critical role in our team's QA and peer review process; I reviewed more than 90% of all pull requests. {/n}On top of my leadership and research responsibilities, I also contributed a fair amount of code as well. I owned some of the more challenging development tasks on my team. At NCR, I furthered my proficiency in React and NodeJS, and I gained proficiency in TypeScript, Java, Spring Boot, Cypress, and Jest. {/n}My team helped build NCR's next generation point of sale product. We replaced an old .NET client application with React. We built a BFF server (NestJS) to broker communication between the client and back-end server, transforming large and awkward XML payloads into smaller, more intuitive JSON contracts. And we built a Spring Boot server to broker communication between the client and an array of devices: printers, scanners, scales, and PIN pads."
    },
    {
        "id": "resimplifi",
        "name": "Resimplifi",
        "logo": "logo-resimp.png",
        "images": [
            "resimp-search-1.png",
            "resimp-search-2.png",
            "resimp-search-3.png",
            "resimp-property-listing-1.png",
            "resimp-brokers.png",
            "resimp-broker.png"
        ],
        "summary": "Resimplifi is a Multiple Listing Service for commercial real estate. It's the Zillow for retail, industrial, and office space. I joined the project about midway through it's production lifecycle. At the time, it was dangerously behind schedule. There was a large vacuum in engineering expertise and leadership. I was brought on to help stabilize the project and bring it up to speed.{/n}Preserving a healthy working relationship with the client was perhaps our biggest challenge. When I first joined, we had to have some difficult conversations about the project timeline - some features had to be pushed back. The client was obviously disappointed. However, after lots of planning and dialog, we were able to identify and preserve their most important features. We came up with a new timeline that still aligned with their core business objectives. And they really appreciated the new vision, confidence, and enthusiasm on our team. That went a long way into quieting their concerns.{/n}But we also had to execute on that vision. As lead engineer, I was responsible for all software solutions: from our back-end data services to our public-facing web pages. We had to deliver some complex features: authentication, image processing, searching and filtering, spatial data visualization, and mobile design optimization. Unfortunately, the application architecture needed some major retooling. The code base was difficult to maintain and scale. It was error prone. To meet our deadlines, our team had to deliver these features and rework the architecture in parallel. It was a risky strategy. Our progress that first month was slow. But we were confident our investment would pay off over time.{/n}Our team was aggressively agile. I was in constant communication with the designer, data architect, and client to identify any issues or roadblocks. This allowed us to adapt and overcome obstacles quickly. There were many late nights. We ate dinner at the office on several occasions. But we held our deadlines, and delivered a quality product I am extremely proud of."
    },
    {
        "id": "pjm",
        "name": "PJM",
        "logo": "logo-mjp.png",
        "images": [
            "mjp-mapping-tool.jpg",
            "mjp-war-room-2.png"
        ],
        "summary": "PJM monitors the electrical infrastructure in many Midwestern and Mid-Atlantic states. They oversee a huge network of substations, transmission lines, and generators. It's their responsibility to identify and mitigate power shortages in the system. Data efficacy is critical to PJM's mission. It's imperative the physical grid stay in sync with their internal grid. If a substation is added, or a line is replaced, it must be reflected in PJMs internal data, maps, and applications. Unfortunately, the mapping tool they used to add and update their internal system was unreliable. {/n}I collaborated with PJM to identify the pain points in their mapping application and implement a solution. We found the tool was polluted with inconsistent behavior, awkward user interface design, and nasty bugs. To address these issues, I overhauled the core architecture of the application. I organized unstructured code using industry best practices like OOP and DRY. And I simplified the user interface. After the refactor, the application was much more reliable, consistent, intuitive, and maintainable."
    },
    {
        "id": "myfoodstand",
        "name": "My Food Stand",
        "logo": "logo-myfoodstand.png", 
        "images": [
            "myfoodstand-home.jpg",
            "myfoodstand-consumer-index.jpg",
            "myfoodstand-consumer-search.jpg"
        ],
        "summary": "My Food Stand was a business venture my friend and I founded in 2014. It's a platform designed to promote transparency and sustainability in the Minneapolis food market. When we buy food, we typically don't know anything about its origin. Where did the ingredients come from? Were they produced ethically and sustainably? How did they impact the environment? We sought to answer these questions. On our site, grocery stores and restaurants could share these details directly with consumers. We saw an opportunity for businesses to capitalize on the local and organic food movement.{/n}I designed, built, and produced the website myself, a first for me. Until then, my experience in web development was almost exclusively coding. This project required command of the whole application lifecycle. I learned so much: graphic design tools, ui best practices, database design, application architecture, dev ops, and video editing."
    },
    {
        "id": "itm",
        "name": "ITM Twentyfirst",
        "logo": "logo-mti.png",
        "images": [
            "mti-home.png",
            "mti-connect.png"
        ],
        "summary": "At ITM Twentyfirst, I helped build and maintain Connect, ITM's complex and evolving enterprise application. I became proficient in Agile methodology and tools (Git, Jira). I managed large and complex data sets. I wrote advanced queries and stored procedures. I modified columns and table relationships to reflect evolving business logic. I observed best practices around normalization and security. I replaced older technologies (Silverlight, VB.NET, jQuery) with new (KnockoutJS, AngularJS, SignalR, Bootstrap)."
    }
]